       IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE-SALARY-REPORT.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       SELECT EMPLOYEE-INFO-FILE ASSIGN TO "/Users/input.txt".
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS EMPLOYEE-RECORD
           ORGANIZATION IS LINE SEQUENTIAL.

       SELECT EMPLOYEE-SALARY-REPORT-FILE ASSIGN TO "/Users/output.txt".
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS REPORT-RECORD
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  EMPLOYEE-INFO-FILE
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS EMPLOYEE-RECORD.
       01  EMPLOYEE-RECORD.
           05  EMPID           PIC 9(6).
           05  EMPNAME         PIC X(20).
           05  EMPSALARY       PIC 9(7)V99.

       FD  EMPLOYEE-SALARY-REPORT-FILE
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS EMPLOYEE-RECORD.
           01  REPORT-RECORD     PIC X(80).

       WORKING-STORAGE SECTION.
       01  RUNNING-TOTAL    PIC 9(11)V99 VALUE ZERO.
       01  HEADER1          PIC X(20) VALUE "Employee ID".
       01  HEADER2          PIC X(20) VALUE "Employee Name".
       01  HEADER3          PIC X(20) VALUE "Salary".
       01  HEADER4          PIC X(20) VALUE "Running Total".

       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           OPEN INPUT EMPLOYEE-INFO-FILE
           OPEN OUTPUT EMPLOYEE-SALARY-REPORT-FILE

           WRITE REPORT-RECORD FROM HEADER1
           WRITE REPORT-RECORD FROM HEADER2 AFTER ADVANCING 21 POSITION
           WRITE REPORT-RECORD FROM HEADER3 AFTER ADVANCING 41 POSITION
           WRITE REPORT-RECORD FROM HEADER4 AFTER ADVANCING 61 POSITION
           READ EMPLOYEE-INFO-FILE
           WRITE REPORT-RECORD FROM SPACE

       PERFORM UNTIL EMPLOYEE-INFO-FILE-STATUS NOT = "0"
           MOVE EMPID TO REPORT-RECORD(1:6)
           MOVE EMPNAME TO REPORT-RECORD(7:20)
           MOVE EMPSALARY TO REPORT-RECORD(27:9)

           ADD EMPSALARY TO RUNNING-TOTAL
           MOVE RUNNING-TOTAL TO REPORT-RECORD(37:12)
           WRITE REPORT-RECORD

           READ EMPLOYEE-INFO-FILE
       END-PERFORM

           CLOSE EMPLOYEE-SALARY-REPORT-FILE
           CLOSE EMPLOYEE-INFO-FILE.

       END PROGRAM EMPLOYEE-SALARY-REPORT.
