000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. HelloWorld.
000003 AUTHOR. SIMON VARGAS.
000004*This is a simple COBOL program that prints "Hello, World!" to the console.
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008
000009 PROCEDURE DIVISION.
000010 0100-START-HERE.
000011    DISPLAY "Hello, World!".
000012 STOP RUN.
000013 END PROGRAM HelloWorld.
000014
